// Управление светодиодом с кнопки с инверсией (циклично)

const int led=13; // переменная для светодиода на контакте 13
const int button=2;  // переменная для кнопки на контакте 2

void setup() 

  { 
 pinMode(led, OUTPUT); // настраиваем контакт для светодиода как выход
 pinMode(button, INPUT); // настраиваем контакт для кнопки как вход
  } 

 void loop() 

{ 
 if(digitalRead(button)==HIGH) //если кнопка нажата ... 
  {     
  digitalWrite(led,!digitalRead(led));  //включаем светодиод (возможент эффект залипания кнопки)
  delay(100); // небольная защита от дребезга кнопки 
   } 
} 
