#include <Servo.h>  // Подкючаем библиотеку для сервопривода
Servo myservo;  // Создаём объект сервопривода
const int pot = 5;  // Объявляем переменную для потенциометра на А5
int val = 0;  // Объявляем переменную для хранения значений

void setup()  // Старт и настройки программы
{
  myservo.attach(9);  // Назначаем D9 для сервопривода
}

void loop() // Основной цикл программы
{
  // Считываем в переменную значения потенциометра
  val = analogRead(pot);  
  // Преобразуем значения до нужного диапазона
  val = map (val, 0, 1023, 0, 179); 
  myservo.write(val); // Управляем положением сервопривода
  // Небольшая задержка, чтобы вал успел зафиксироваться, прежде
  // чем поступит новая команда
  delay(15);  
}
