#include <Arduino.h>
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// Пример использования класса для управления яркостью светодиода при помощи потенциометра
// Пример может использоваться для платы ArduinoDevBoard 2.0 (пин потенциометра А1)
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
class Knob {
  private:
    int _pin;
  public:
   Knob(int pin){ // Функция создания объекта потенциометра
     _pin = pin;
     pinMode(_pin, INPUT);
   }

   inline int getAngle(){ // Встроенная функция
	 int sensor_value = analogRead(_pin); // Считываем состояние
	 int angle = map(sensor_value, 0, 1023, 0, 255); // Преобразуем значение
	 return angle; // Возвращаем значение
   }
};

const int KNOB_PIN = A0;
Knob knob(KNOB_PIN); // Объект потенциометра

void setup() {
  pinMode(10, OUTPUT);
}

void loop() {
  int brightness = knob.getAngle();;
  analogWrite(10, brightness);
}
/*********************************************************************************************************
The end of file
*********************************************************************************************************/