// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// Простой учебный пример для светодиодной матрицы 8х8 MAX7219
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
#include <Arduino.h>
#include <LedControl.h>

LedControl lc=LedControl(8, 6, 7, 1); // Пины Arduino для Eyes Ver 2.1 Robodem 2016

void setup()
{
  lc.shutdown(0, false); // Дисплей с отключенным энергосбережением, например: (0, true)
  lc.setIntensity(0, 0); // Яркость от 0-15, например: (0, 10)
  lc.clearDisplay(0); // Необходимая очистка матрицы. Значение по умолчанию - 0
}

void loop()
{
  // Способ № 1
  lc.setLed(0, 3, 4, true); //  Где 0 - №  экрана (0-15), 3 - № колонки, 4 № - строки, true - включен
  // Способ № 2
  lc.setRow(0, 6, B01011111); // (0 - №  экрана (0-15), строка 0-7, ячейки 0-7)
  /*
  // Способ вывести на экран знак #
  lc.setRow(0, 2, B00010100);
  lc.setRow(0, 3, B00111110);
  lc.setRow(0, 4, B00010100);
  lc.setRow(0, 5, B00111110);
  lc.setRow(0, 6, B00010100);
  // Таблица символов по ссылке know/MAX7219/table_simbols.txt
  */
  /*
  // Простая анимация
  for(int row= 0; row <  8;  row++) {
    lc.setRow(0, row, B01000010);
    delay(100);
  }
  for(int row= 8; row >  0;  row--) {
    lc.setRow(0, row, B100001);
    delay(100);
  }*/
}
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
