#include <Arduino.h>
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// Учебный пример использования библиотеки антидребезга Button_Simple
// V 1.0
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
#include <Button_Simple.h>

Button_Simple button(11); // Пин кнопки

void setup() {
  pinMode(3, OUTPUT);
  Serial.begin(9600);
}

void loop() {
  static int click = 0; // Состояние режима 1/0
  button.scan(); // Инициализация библиотеки
  while (button.clicked()) { // Если нажали
    if (++click >= 2) { click = 0; } // Счётчик с ограничителем (0/1)
  }
  if (click == 1) { digitalWrite(3, HIGH); }
  else { digitalWrite(3, LOW); }
  Serial.println(click);
}

// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
// END FILE
// -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=- //
